In [1]:
%load_ext sql

In [2]:
%sql postgresql://student:student@127.0.0.1/sparkifydb

'Connected: student@sparkifydb'

In [3]:
%sql SELECT * FROM songplays LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[(1, datetime.datetime(2018, 11, 17, 0, 2, 24, 796000), 49, 'paid', None, None, 648, 'San Francisco-Oakland-Hayward, CA', 'Mozilla/5.0 (Windows NT 5.1; rv:31.0) Gecko/20100101 Firefox/31.0'),
 (2, datetime.datetime(2018, 11, 17, 0, 6, 40, 796000), 49, 'paid', None, None, 648, 'San Francisco-Oakland-Hayward, CA', 'Mozilla/5.0 (Windows NT 5.1; rv:31.0) Gecko/20100101 Firefox/31.0'),
 (3, datetime.datetime(2018, 11, 17, 0, 10, 51, 796000), 49, 'paid', None, None, 648, 'San Francisco-Oakland-Hayward, CA', 'Mozilla/5.0 (Windows NT 5.1; rv:31.0) Gecko/20100101 Firefox/31.0'),
 (4, datetime.datetime(2018, 11, 17, 0, 14, 35, 796000), 49, 'paid', None, None, 648, 'San Francisco-Oakland-Hayward, CA', 'Mozilla/5.0 (Windows NT 5.1; rv:31.0) Gecko/20100101 Firefox/31.0'),
 (5, datetime.datetime(2018, 11, 17, 0, 17, 39, 796000), 49, 'paid', None, None, 648, 'San Francisco-Oakland-Hayward, CA', 'Mozilla/5.0 (Windows NT 5.1; rv:31.0) Gecko/20100101 Firefox/31.0')]

In [4]:
%sql SELECT * FROM users LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[(10, None, 'Sylvie', 'Cruz', 'F', 'free'),
 (33, None, 'Bronson', 'Harris', 'M', 'free'),
 (54, None, 'Kaleb', 'Cook', 'M', 'free'),
 (37, None, 'Jordan', 'Hicks', 'F', 'free'),
 (2, None, 'Jizelle', 'Benjamin', 'F', 'free')]

In [5]:
%sql SELECT * FROM songs LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[('SOQOTLQ12AB01868D0', 'Clementina Santafè', 'ARGCY1Y1187B9A4FA5', 0, 153.33832),
 ('SOGVQGJ12AB017F169', 'Ten Tonne', 'AR62SOJ1187FB47BB5', 2005, 337.68444),
 ('SOBAYLL12A8C138AF9', 'Sono andati? Fingevo di dormire', 'ARDR4AC1187FB371A1', 0, 511.16363),
 ('SOOJPRH12A8C141995', 'Loaded Like A Gun', 'ARBGXIG122988F409D', 0, 173.19138),
 ('SOBCOSW12A8C13D398', 'Rumba De Barcelona', 'AR7SMBG1187B9B9066', 0, 218.38322)]

In [6]:
%sql SELECT * FROM artists LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[('ARGCY1Y1187B9A4FA5', 'Gloriana', 'Nashville, TN.', 36.16778, -86.77836),
 ('AR62SOJ1187FB47BB5', 'Chase & Status', '', nan, nan),
 ('ARDR4AC1187FB371A1', 'Montserrat Caballé;Placido Domingo;Vicente Sardinero;Judith Blegen;Sherrill Milnes;Georg Solti', '', nan, nan),
 ('ARBGXIG122988F409D', 'Steel Rain', 'California - SF', 37.77916, -122.42005),
 ('AR7SMBG1187B9B9066', 'Los Manolos', '', nan, nan)]

In [7]:
%sql SELECT * FROM time LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[(datetime.datetime(2018, 11, 17, 0, 2, 24, 796000), 0, 17, 46, 11, 2018, 5),
 (datetime.datetime(2018, 11, 17, 0, 6, 40, 796000), 0, 17, 46, 11, 2018, 5),
 (datetime.datetime(2018, 11, 17, 0, 10, 51, 796000), 0, 17, 46, 11, 2018, 5),
 (datetime.datetime(2018, 11, 17, 0, 14, 35, 796000), 0, 17, 46, 11, 2018, 5),
 (datetime.datetime(2018, 11, 17, 0, 17, 39, 796000), 0, 17, 46, 11, 2018, 5)]

## REMEMBER: Restart this notebook to close connection to `sparkifydb`
Each time you run the cells above, remember to restart this notebook to close the connection to your database. Otherwise, you won't be able to run your code in `create_tables.py`, `etl.py`, or `etl.ipynb` files since you can't make multiple connections to the same database (in this case, sparkifydb).